In [1]:
#import the modules
import pandas as pd
import geopandas as gpd
import urllib.request
import os
import numpy as np
from scipy import stats
import matplotlib.pyplot as plt

In [26]:
recycle=pd.read_csv('Recycling_Diversion_and_Capture_Rates.csv')
recycle.head()

,Zone,District,Fiscal Month Number,Fiscal Year,Month Name,Diversion Rate-Total (Total Recycling / Total Waste),Capture Rate-Paper (Total Paper / Max Paper),Capture Rate-MGP (Total MGP / Max MGP),Capture Rate-Total ((Total Recycling - Leaves (Recycling)) / (Max Paper + Max MGP))x100
0,Brooklyn North,BKN01,10,2019,April,14.7,44.9,43.0,44.1
1,Brooklyn North,BKN02,10,2019,April,20.0,34.2,57.9,41.2
2,Brooklyn North,BKN03,10,2019,April,12.2,33.5,44.9,38.2
3,Brooklyn North,BKN04,10,2019,April,15.5,35.2,68.5,48.8
4,Brooklyn North,BKN05,10,2019,April,10.1,22.3,45.1,31.5

In [27]:
boroughABV = ['MN', 'BX', 'BK', 'QE', 'QW', 'SI']
borough = ['Manhattan', 'Bronx', 'Brooklyn', 'Queens', 'Staten Island']
boroughNum = [1, 2, 3, 4, 4, 5]
recycle['borough'] = ""
recycle['borough_cd'] = 1
recycle['borough_id'] = ""

In [33]:
for i in range(len(recycle)):
    index = boroughABV.index(recycle.District[i][:2])
    recycle.borough[i] = boroughNum[index]
    recycle.borough_cd[i] = recycle.District[i][-2:]
    recycle.borough_id[i] = str(recycle['borough'][i]) + "__" + str(recycle['borough_cd'][i])

<ipython-input-33-84f09f54334e>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  recycle.borough[i] = boroughNum[index]
<ipython-input-33-84f09f54334e>:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  recycle.borough_cd[i] = recycle.District[i][-2:]
<ipython-input-33-84f09f54334e>:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  recycle.borough_id[i] = str(recycle['borough'][i]) + "__" + str(recycle['borough_cd'][i])

In [34]:
recycle.head()

,Zone,District,Fiscal Month Number,Fiscal Year,Month Name,Diversion Rate-Total (Total Recycling / Total Waste),Capture Rate-Paper (Total Paper / Max Paper),Capture Rate-MGP (Total MGP / Max MGP),Capture Rate-Total ((Total Recycling - Leaves (Recycling)) / (Max Paper + Max MGP))x100,borough,borough_cd,borough_id
0,Brooklyn North,BKN01,10,2019,April,14.7,44.9,43.0,44.1,3,1,3__1
1,Brooklyn North,BKN02,10,2019,April,20.0,34.2,57.9,41.2,3,2,3__2
2,Brooklyn North,BKN03,10,2019,April,12.2,33.5,44.9,38.2,3,3,3__3
3,Brooklyn North,BKN04,10,2019,April,15.5,35.2,68.5,48.8,3,4,3__4
4,Brooklyn North,BKN05,10,2019,April,10.1,22.3,45.1,31.5,3,5,3__5

In [82]:
recycle.to_csv('recycle.csv')

In [72]:
gross = pd.read_csv('DSNY_Monthly_Tonnage_Data.csv')
gross.head()

,MONTH,BOROUGH,COMMUNITYDISTRICT,REFUSETONSCOLLECTED,PAPERTONSCOLLECTED,MGPTONSCOLLECTED,RESORGANICSTONS,SCHOOLORGANICTONS,LEAVESORGANICTONS,XMASTREETONS,BOROUGH_ID
0,1993 / 11,Manhattan,1,625.2,119.4,34.4,NaN,NaN,NaN,NaN,1
1,1995 / 09,Manhattan,1,633.1,117.2,45.8,NaN,NaN,NaN,NaN,1
2,1995 / 08,Manhattan,1,627.5,82.4,35.6,NaN,NaN,NaN,NaN,1
3,2012 / 03,Manhattan,1,1194.4,341.6,210.8,NaN,NaN,NaN,NaN,1
4,1992 / 03,Manhattan,1,726.0,NaN,NaN,NaN,NaN,NaN,NaN,1

In [73]:
gross['YEAR'] = 1
gross['BOROUGH_INDEX'] = "1"
for i in range(len(gross)):
    gross['YEAR'][i] = gross['MONTH'][i][:4]
    month = gross['MONTH'][i][-2:]
    gross['MONTH'][i] = month
    gross['BOROUGH_INDEX'][i] = str(gross['BOROUGH_ID'][i]) + "__" + str(gross['COMMUNITYDISTRICT'][i])
gross.head()

<ipython-input-73-04c4c5d8e5a5>:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  gross['YEAR'][i] = gross['MONTH'][i][:4]
<ipython-input-73-04c4c5d8e5a5>:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  gross['MONTH'][i] = month
<ipython-input-73-04c4c5d8e5a5>:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  gross['BOROUGH_INDEX'][i] = str(gross['BOROUGH_ID'][i]) + "__" + str(gross['COMMUNITYDISTRICT'][i])

,MONTH,BOROUGH,COMMUNITYDISTRICT,REFUSETONSCOLLECTED,PAPERTONSCOLLECTED,MGPTONSCOLLECTED,RESORGANICSTONS,SCHOOLORGANICTONS,LEAVESORGANICTONS,XMASTREETONS,BOROUGH_ID,YEAR,BOROUGH_INDEX
0,11,Manhattan,1,625.2,119.4,34.4,NaN,NaN,NaN,NaN,1,1993,1__1
1,09,Manhattan,1,633.1,117.2,45.8,NaN,NaN,NaN,NaN,1,1995,1__1
2,08,Manhattan,1,627.5,82.4,35.6,NaN,NaN,NaN,NaN,1,1995,1__1
3,03,Manhattan,1,1194.4,341.6,210.8,NaN,NaN,NaN,NaN,1,2012,1__1
4,03,Manhattan,1,726.0,NaN,NaN,NaN,NaN,NaN,NaN,1,1992,1__1

In [74]:
newcol = ['MONTH', 'YEAR', 'BOROUGH', 'BOROUGH_INDEX', 'REFUSETONSCOLLECTED', 'PAPERTONSCOLLECTED', 'MGPTONSCOLLECTED', 'RESORGANICSTONS', 'SCHOOLORGANICTONS', 'LEAVESORGANICTONS', 'XMASTREETONS', 'COMMUNITYDISTRICT', 'BOROUGH_ID']
gross = gross[newcol]
gross.head()

,MONTH,YEAR,BOROUGH,BOROUGH_INDEX,REFUSETONSCOLLECTED,PAPERTONSCOLLECTED,MGPTONSCOLLECTED,RESORGANICSTONS,SCHOOLORGANICTONS,LEAVESORGANICTONS,XMASTREETONS,COMMUNITYDISTRICT,BOROUGH_ID
0,11,1993,Manhattan,1__1,625.2,119.4,34.4,NaN,NaN,NaN,NaN,1,1
1,09,1995,Manhattan,1__1,633.1,117.2,45.8,NaN,NaN,NaN,NaN,1,1
2,08,1995,Manhattan,1__1,627.5,82.4,35.6,NaN,NaN,NaN,NaN,1,1
3,03,2012,Manhattan,1__1,1194.4,341.6,210.8,NaN,NaN,NaN,NaN,1,1
4,03,1992,Manhattan,1__1,726.0,NaN,NaN,NaN,NaN,NaN,NaN,1,1

In [51]:
population = pd.read_csv('New_York_City_Population_By_Community_Districts.csv')
population.head()

,Borough,CD Number,CD Name,1970 Population,1980 Population,1990 Population,2000 Population,2010 Population
0,Bronx,1,"Melrose, Mott Haven, Port Morris",138557,78441,77214,82159,91497
1,Bronx,2,"Hunts Point, Longwood",99493,34399,39443,46824,52246
2,Bronx,3,"Morrisania, Crotona Park East",150636,53635,57162,68574,79762
3,Bronx,4,"Highbridge, Concourse Village",144207,114312,119962,139563,146441
4,Bronx,5,"University Hts., Fordham, Mt. Hope",121807,107995,118435,128313,128200

In [65]:
borough = ['Manhattan', 'Bronx', 'Brooklyn', 'Queens', 'Staten Island']
boroughNum = [1, 2, 3, 4, 5]
population['Borough_num'] = 1
population['BOROUGH_INDEX'] = '1'

for i in range(len(population)):
    index = borough.index(population.Borough[i])
    population.Borough_num[i] = boroughNum[index]
    population.BOROUGH_INDEX[i] = str(population['Borough_num'][i]) + "__" + str(population['CD Number'][i])
population.head()

<ipython-input-65-37db2ebfb43e>:8: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  population.Borough_num[i] = boroughNum[index]
<ipython-input-65-37db2ebfb43e>:9: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  population.BOROUGH_INDEX[i] = str(population['Borough_num'][i]) + "__" + str(population['CD Number'][i])

,Borough,CD Number,CD Name,1970 Population,1980 Population,1990 Population,2000 Population,2010 Population,Borough_num,Borough_index,BOROUGH_INDEX
0,Bronx,1,"Melrose, Mott Haven, Port Morris",138557,78441,77214,82159,91497,2,2__1,2__1
1,Bronx,2,"Hunts Point, Longwood",99493,34399,39443,46824,52246,2,2__2,2__2
2,Bronx,3,"Morrisania, Crotona Park East",150636,53635,57162,68574,79762,2,2__3,2__3
3,Bronx,4,"Highbridge, Concourse Village",144207,114312,119962,139563,146441,2,2__4,2__4
4,Bronx,5,"University Hts., Fordham, Mt. Hope",121807,107995,118435,128313,128200,2,2__5,2__5

In [66]:
pop = population[['2010 Population', 'BOROUGH_INDEX']]
pop.head()

   2010 Population BOROUGH_INDEX
0            91497          2__1
1            52246          2__2
2            79762          2__3
3           146441          2__4
4           128200          2__5

In [75]:
gross1 = pd.merge(gross, pop, on=['BOROUGH_INDEX'])
gross1.head()

,MONTH,YEAR,BOROUGH,BOROUGH_INDEX,REFUSETONSCOLLECTED,PAPERTONSCOLLECTED,MGPTONSCOLLECTED,RESORGANICSTONS,SCHOOLORGANICTONS,LEAVESORGANICTONS,XMASTREETONS,COMMUNITYDISTRICT,BOROUGH_ID,2010 Population
0,11,1993,Manhattan,1__1,625.2,119.4,34.4,NaN,NaN,NaN,NaN,1,1,60978
1,09,1995,Manhattan,1__1,633.1,117.2,45.8,NaN,NaN,NaN,NaN,1,1,60978
2,08,1995,Manhattan,1__1,627.5,82.4,35.6,NaN,NaN,NaN,NaN,1,1,60978
3,03,2012,Manhattan,1__1,1194.4,341.6,210.8,NaN,NaN,NaN,NaN,1,1,60978
4,03,1992,Manhattan,1__1,726.0,NaN,NaN,NaN,NaN,NaN,NaN,1,1,60978

In [83]:
gross1['NORM_REFUSE'] = gross1['REFUSETONSCOLLECTED']/gross1['2010 Population']
gross1['NORM_PAPER'] = gross1['PAPERTONSCOLLECTED']/gross1['2010 Population']
gross1['NORM_MGP'] = gross1['MGPTONSCOLLECTED']/gross1['2010 Population']
gross1['NORM_RESORG'] = gross1['RESORGANICSTONS']/gross1['2010 Population']
gross1['NORM_SCHOOLORG'] = gross1['SCHOOLORGANICTONS']/gross1['2010 Population']
gross1['NORM_LEAVES'] = gross1['LEAVESORGANICTONS']/gross1['2010 Population']
gross1['NORM_XMAS'] = gross1['XMASTREETONS']/gross1['2010 Population']
gross1['NORM_DIVRATE'] = (gross1['NORM_PAPER']+gross1['NORM_MGP'])/(gross1['NORM_REFUSE']+gross1['NORM_PAPER']+gross1['NORM_MGP'])
gross1.head()

,MONTH,YEAR,BOROUGH,BOROUGH_INDEX,REFUSETONSCOLLECTED,PAPERTONSCOLLECTED,MGPTONSCOLLECTED,RESORGANICSTONS,SCHOOLORGANICTONS,LEAVESORGANICTONS,...,BOROUGH_ID,2010 Population,NORM_REFUSE,NORM_PAPER,NORM_MGP,NORM_RESORG,NORM_DIVRATE,NORM_SCHOOLORG,NORM_LEAVES,NORM_XMAS
0,11,1993,Manhattan,1__1,625.2,119.4,34.4,NaN,NaN,NaN,...,1,60978,0.010253,0.001958,0.000564,NaN,0.197433,NaN,NaN,NaN
1,09,1995,Manhattan,1__1,633.1,117.2,45.8,NaN,NaN,NaN,...,1,60978,0.010382,0.001922,0.000751,NaN,0.204748,NaN,NaN,NaN
2,08,1995,Manhattan,1__1,627.5,82.4,35.6,NaN,NaN,NaN,...,1,60978,0.010291,0.001351,0.000584,NaN,0.158283,NaN,NaN,NaN
3,03,2012,Manhattan,1__1,1194.4,341.6,210.8,NaN,NaN,NaN,...,1,60978,0.019587,0.005602,0.003457,NaN,0.316235,NaN,NaN,NaN
4,03,1992,Manhattan,1__1,726.0,NaN,NaN,NaN,NaN,NaN,...,1,60978,0.011906,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [ ]:
GROSS1